12/data/attachments/e2e45c219d7bd3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7984fc7a-05c9-4a1e-a54f-bfeba629a358</nif:username>
            <nif:friendToBeAdded>Caitlin_daughter_Friend_42009_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>